<template lang="pug">
v-container.pa-10
  v-row.pt-5.pb-5.ma-0
    h1 物流管理
  v-divider
  v-row.pt-5.pb-5.ma-0
    p
      | 以下為全站設定，提供買家選擇商品取貨方式。溫馨提醒，目前貨態、商品追蹤碼等資訊，皆需由賣家於訂單管理設定！
  v-divider
  v-expansion-panels.mb-5(v-for='(item, i) in logistics' :key='i')
    v-expansion-panel
      v-expansion-panel-header
        | {{ item.name }}
      v-expansion-panel-content
        v-row.pt-5.pb-5(align='start')
          v-col(cols='12' lg='6')
            h4(color='blue') {{ item.remark }}
            div(v-html='item.text')
          v-divider(vertical='')
          v-col(cols='12' lg='6')
            v-text-field(label='運費設定' v-model='item.delivery_price')
            v-btn.ma-2(color='green' @click='onUpdatPriceClickHandler')
              | 更新
            p 運費為綠界提供之預設值，請依實際狀況更新
    v-switch(v-model='item.open' inset='')

</template>



<script>
export default {
  components: {},
  data() {
    return {
      is_loading_table_data: false,
      logistics: [
        {
          name:"賣家宅配",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "nochoice",
          delivery_price: 200,
          delivery_type: "delivery",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 14,
          remark: "若您欲提供買家選擇賣家宅配取貨方式，請開啟此物流選項。",
          text: `                
                <p>此為商城提供之預設買家取貨方式，運費需由賣家視寄件方式自行決定。材積限制、包裝限制等寄件規範及準則將依超商為主</p>
                `,
        },
        {
          name:"7-11",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "uni",
          delivery_price: 65,
          delivery_type: "store",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 15,
          remark: "若您欲提供買家選擇7-11超商取貨方式，請開啟此物流選項。",
          text: `
                <h3>服務說明：</h3>
                <p>本店寄貨，他店取貨，預設運費價格：69元(含稅)。</p>
                <h3>材積限制：</h3>
                <p>需 ≦ 45cm*30cm*30cm，最長邊 ≦ 45cm，其他兩邊則需均 ≦ 30cm；重量不得超過5公斤。</p>
                <h3>包裝限制：</h3>
                <p>門市無提供包裝服務，請自行包裝。禁運品項(請詳閱超商服務條款)： ✽現金、有價證券、展演會票券、禮券 ✽易碎品 ✽生鮮蔬果魚肉食品、低溫或需恆溫控制商品、限量不可複製品、重要文件、證件類 、活體動植物 、個人藥品、 精密儀器、3C等貴重物品 ✽化學藥品、液體 ✽非法禁運商品。</p>
                <h3>包裝提醒：</h3>
                <p>1. 完成寄件/取件交易後，恕無法取消寄件、退款、或退回貨品；寄件者寄件後無法要求提前退回貨品。 2. 寄件：請填寫寄件者及取件者 「與證件相符之真實姓名」，以確保雙方權益。 3. 取件：取件者需告知店員真實姓名，並「出示與貨品上取件者姓名相符之身份證明文件正本」，於單據上「簽名」後方可領取商品。(若取件者未出示上述證件或拒絕簽名，門市無法提供取件服務) 。寄件最新規範及準則將依超商為主。</p>`,
        },
        {
          name:"全家",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "family",
          delivery_price: 65,
          delivery_type: "store",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 16,
          remark: "若您欲提供買家選擇全家超商取貨方式，請開啟此物流選項。",
          text: `
                <h3>服務說明：</h3>
                <p>本店寄貨，他店取貨，運費價格：69元。</p>
                <h3>材積限制：</h3>
                <p>長＋寬＋高＜105公分，單邊長度＜45公分(建議適當規格45cm*30cm*30cm)，總重量不得超過5公斤。</p>
                <h3>包裝限制：</h3>
                <p>門市無提供 包裝服務，請自行包裝。禁運品項(請詳閱超商服務條款)： ✽生鮮(生 鮮食品、易壞水果) ✽低溫(冰淇淋、蛋糕等任何需低溫保存之物品) ✽ 液體 ✽易碎物品(玻璃器皿、玻璃瓶裝酒、瓶裝罐頭等) ✽精密3C(電腦 主機、螢幕、手機、數位相機等) ✽超材超重 ✽貴重(身分證件、現金、 支票、金飾或鑽石) ✽未妥善</p>
                <h3>包裝提醒：</h3>
                <p>1. 完成寄件/取件交易後，恕 無法取消寄件、退款、或退回貨品；寄件者寄件後無法要求提前退回貨品。 2. 寄件：請填寫寄件者及取件者「與證件相符之真實姓名」， 以確保雙方權益。 3. 取件：取件者需告知店員真實姓名，並「出示與 貨品上取件者姓名相符之身份證明文件正本」，於單據上「簽名」後 方可領取商品。(若取件者未出示上述證件或拒絕簽名，門市無法提供 取件服務)。寄件最新規範及準則將依超商為主。</p>`,
        
        },
        {
          name:"OK Mart",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "ok",
          delivery_price: 65,
          delivery_type: "store",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 17,
          remark: "若您欲提供買家選擇OK Mart超商取貨方式，請開啟此物流選項。",
          text: `
                <h3>服務說明：</h3>
                <p>本店寄貨，他店取貨，運費價格：58元(含稅)。</p>
                <h3>材積限制：</h3>
                <p>需 ≦ 45cm*ˇ30cm*30cm，最長邊 ≦ 45cm，其他兩邊則需均 ≦ 30cm；重量不得超過5公斤。</p>
                <h3>包裝限制：</h3>
                <p>門市無提供包裝服務，請自行包裝。禁運品項(請詳閱超商無物條款)： ＊現 金、有價證券、展演會票券、禮券 ＊易碎品 ＊生鮮蔬果魚肉食品、低溫貨需恆溫控制商品 ＊限量不可複製品、重要文件、證 件類 ＊活體動植物 ＊個人藥品 ＊精密儀器、3C等貴重物品 ＊化學藥品、液體 ＊非法禁運商品</p>
                <h3>包裝提醒：</h3>
                <p>1. 完成寄件/取件交易後，恕無法取消寄件、退款或退回商品；寄件者寄件後無法要求提前退回貨品。 2. 寄件：請填寫寄件者及取件者「與證件相符之真實姓名」，以確保雙方權益。 3. 取件：取件者須告知店員真實姓名，並「出示與貨品上取件者姓名相符之身分證明文件正本」，於單據上「簽名」後方可領 取商品。(若取件者未出示上述證件或拒絕簽名，門市無法提供取件服務) 寄件最新規範及準則將依超商為主。</p>`,
        
        },
        {
          name:"萊爾富",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "hilife",
          delivery_price: 65,
          delivery_type: "store",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 18,
          remark: "若您欲提供買家選擇萊富家超商取貨方式，請開啟此物流選項。",
          text: `
                <h3>服務說明：</h3>
                <p>本店寄貨，他店取貨 運費價格：58元(含稅)。</p>
                <h3>材積限制：</h3>
                <p>貨品材 積長寬高三邊總和 ≦ 105公分、最長邊 ≦ 45cm，總重量不得超過5公斤。</p>
                <h3>包裝限制：</h3>
                <p>門市無提供包裝服務，請自行包裝 禁 運品項(請詳閱超商服務條款)： ✽生鮮(生鮮食品、易壞水果) ✽低溫(冰淇淋、蛋糕等任何需低溫保存之物品) ✽液體 ✽易碎 物品(玻璃器皿、玻璃瓶裝酒、瓶裝罐頭等) ✽精密3C(電腦主機、螢幕、手機、數位相機等) ✽超材超重 ✽貴重(身分證件、現 金、支票、金飾或鑽石) ✽未妥善包裝</p>
                <h3>包裝提醒：</h3>
                <p>1. 完成寄件/取件交易後，恕無法取消寄件、退款、或退回貨品；寄件者寄件後 無法要求提前退回貨品。 2. 寄件：請填寫寄件者及取件者「與證件相符之真實姓名」，以確保雙方權益。 3. 取件：取件者需 告知店員真實姓名，並「出示與貨品上取件者姓名相符之身份證明文件正本」，於單據上「簽名」後方可領取商品。(若取件 者未出示上述證件或拒絕簽名，門市無法提供取件服務)寄件最新規範及準則將依超商為主。</p>`,
        
        },
        {
          name:"黑貓宅急便",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "cat",
          delivery_price: 120,
          delivery_type: "delivery",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 19,
          remark: "若您欲提供買家選擇黑貓宅急便寄送包裏，請開啟此物流選項。",
          text: `
                <h3>本島運費計費方式：</h3>
                <p>依包裹尺寸計算(物品的長寬高三邊長度合計，單位為公分) 60公分以下：137元，61-90公分：179元， 91-120公分：221元，121-150公分：263元。</p>
                <h3>外島運費計算方式：</h3>
                <p>60公分以下：231元，61-90公分：294元，91-120公分： 336元，121-150公分：378元 。</p>                
                <h3>包裝提醒：</h3>
                <p>1. 目前僅提供黑貓常溫包裹配送，若您的商品需低溫配送，請選擇其他物流商進行 包裹配送。 2. 如您設定的運費與黑貓實際測量不符時，將以黑貓所訂之運費價格為主。 3. 價日及節日需另外加價。寄件最 新規範及準則將依黑貓為主。</p>`,
        
        },
        {
          name:"大嘴鳥宅配通",
          company_sn: 0,
          create_time: "2021-07-23T17:36:53",
          delivery_company: "bird",
          delivery_price: 120,
          delivery_type: "delivery",
          modify_time: "2021-07-23T17:36:53",
          open: "1",
          sn: 20,
          remark: "若您欲提供買家選擇大嘴鳥宅配通寄送包裏，請開啟此物流選項。",
          text: `
                <h3>本島運費計費方式：</h3>
                <p>依包裹尺寸計算(物品的長寬高三邊長度合計，單位為公分) 60公分以下：132元，61-90公分：174元，91 -120公分：216元，121-150公分：263元。</p>
                <h3>外島運費計算方式：</h3>
                <p>60公分以下：231元，61-90公分：294元，91-120公分： 336元，121-150公分：378元 。</p>
                <h3>包裝提醒：</h3>
                <p>1. 目前僅提供常溫包裹配送，若您的商品需低溫配送，請選擇其他物流商進行 包裹配送。 2. 如您設定的運費與大嘴鳥實際測量不符時，將以大嘴鳥所訂之運費價格為主。 3. 假日及節日需另外加價。寄件 最新規範及準則將依大嘴鳥宅配通為主。</p>
                `
        
        },
      ],
    };
  },
  created() {
    this.is_loading_table_data = true;
    this.loadData();
  },
  computed: {},
  methods: {
    loadData() {
      let _self = this;
      _self.is_loading_table_data = false;
    },
    onUpdatPriceClickHandler(item) {
      console.log(item);
    },
  },
};
</script>

<style lang="scss" scoped>
.v-input--switch {
  position: absolute;
  right: 50px;
  top: -7px;
}
</style>
